БухЭксп/InformationRegisters/CW_ВнешниеПечатныеФормы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ВнешниеПечатныеФормы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Индекс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Обработка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метаданное</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МетаданныеКонфигурации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ВидыПечатейПечатныхФорм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ВидыПечатейПечатныхФорм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыПечатейОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ПечатнаяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПодключаемыеОбъекты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПечатиОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПечатиОрганизаций</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ХранилищеПечати</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидПечати</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВидыПечатейОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ПараметрыСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ПараметрыСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ФамилияИмяАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Comment>Сотрудник</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ФизическиеЛица</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ЛицаПодписывающиеДокументы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ЛицаПодписывающиеДокументы</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительДолжностьАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>400</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РуководительОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ГлБухгалтерОснованиеАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Вариант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ВариантыЛицПодписывающихДокументы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДокументыОтчетаЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДокументыОтчетаЭкспедитора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВариантыСуммированияКоличества.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВариантыСуммированияКоличества</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Суммировать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Равно1</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоГП</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_ВариантыСверткиТабличныхЧастей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ВариантыСверткиТабличныхЧастей</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>СворачиватьПоГрузоперевозкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСверткиПоГрузоперевозкам</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонСверткиПоГрузоперевозкамАнгл</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьИтогиПоГрузоперевозкам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьДополнительныеКолонки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НоменклатураСвертки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнглийский</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеСуммироватьКоличество</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммированиеКоличества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.CW_ВариантыСуммированияКоличества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСвертки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РежимСверткиСтроки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасчитыватьЦенуПослеСвертки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СворачиватьПоДокументуРасходов</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТаблицаЗамены</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЗаменяемаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НаименованияДополнительныхКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НаименованиеКолонки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеКолонкиАнгл</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиНаименований</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШиринаКолонки</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГоризонтальноеПоложение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ШаблоныДополнительныхКолонок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСвертки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиНаименований</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шаблон</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ШаблонАнглийский</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПараметрыСвертки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтрокиСвертки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МониторинговыйПараметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/CommonModules/CW_Печать/Ext/Module.bsl
// ---------------------------------------------------------------------------- 
// ПЕЧАТЬ
// ----------------------------------------------------------------------------

#Область МеханизмыПечати 

Функция ПолучитьПустуюТаблицуПечатныхФорм() Экспорт
	
	Возврат  _сф.т_Создать("ДвоичныеДанные,ИмяОбработки,СсылкаНаОбработку,ДополнительныеПараметрыОбработки,Представление,ЗаменяемаяПФ,ВидОбработки");
	
КонецФункции

Процедура ЗаполнитьТаблицуПечатныхФормОбъектов(МассивИменМетаданных, ТаблицаМакетов) Экспорт
	
	мМетаданные = Новый Массив;
	Для Каждого ИмяМетаданного из МассивИменМетаданных Цикл
		Метаданное = CW_Обмены_ПИ.МетаданноеКонфигурации(ИмяМетаданного);
		мМетаданные.Добавить(Метаданное);
	КонецЦикла;
	
	// пробуем получить собственные печатные формы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПечатныеФормы.Обработка КАК Обработка,
	               |	CW_ВнешниеПечатныеФормы.Наименование КАК Наименование,
	               |	CW_ВнешниеПечатныеФормы.Индекс КАК Индекс
	               |ИЗ
	               |	РегистрСведений.CW_ВнешниеПечатныеФормы КАК CW_ВнешниеПечатныеФормы
	               |ГДЕ
	               |	CW_ВнешниеПечатныеФормы.Метаданное В(&мМетаданные)
	               |	И CW_ВнешниеПечатныеФормы.Обработка.НеИспользуется = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Индекс,
	               |	Наименование
	               |АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("мМетаданные", мМетаданные);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		// добавляем
		НоваяСтрока = ТаблицаМакетов.Добавить();
		НоваяСтрока.ВидОбработки 		= "Внешняя";
		НоваяСтрока.СсылкаНаОбработку 	= Выборка.Обработка;
		НоваяСтрока.Представление 		= Выборка.Наименование;
		
	КонецЦикла; 
	
КонецПроцедуры

Функция ПолучитьМассивИменМетеданных(ПараметрКоманды) Экспорт
	
	МассивИменМетаданных = Новый Массив;
	
	Если ТипЗнч(ПараметрКоманды) = Тип("Массив") Тогда
		Для Каждого СсылкаВМассиве из ПараметрКоманды Цикл
			ИмяМетаданного = СсылкаВМассиве.Метаданные().ПолноеИмя();
			Если МассивИменМетаданных.Найти(ИмяМетаданного) = Неопределено Тогда
				МассивИменМетаданных.Добавить(ИмяМетаданного);
			КонецЕсли;
		КонецЦикла;
	Иначе
		МассивИменМетаданных.Добавить(ПараметрКоманды.Метаданные().ПолноеИмя());
	КонецЕсли;
	
	Возврат МассивИменМетаданных;
	

КонецФункции

// УСТАРЕЛА. Функция - ПолучитьТаблицуПечатныхФорм(СсылкаОбъекта, ИгнорироватьСтандартнуюПроверкуУсловий=Ложь) Экспорт
//
//Следует использовать процедуру ЗаполнитьТаблицуПечатныхФормОбъектов(МассивИменМетаданных, ТаблицаМакетов)
//
Функция ПолучитьТаблицуПечатныхФорм(СсылкаОбъекта, ИгнорироватьСтандартнуюПроверкуУсловий=Ложь) Экспорт
	
	ТаблицаМакетов 		= _сф.т_Создать("ДвоичныеДанные,ИмяОбработки,СсылкаНаОбработку,ДополнительныеПараметрыОбработки,Представление,ЗаменяемаяПФ,ВидОбработки");
	МетаданныеОбъекта 	= СсылкаОбъекта.Метаданные();
	
	Метаданное = CW_Обмены_ПИ.МетаданноеКонфигурации(МетаданныеОбъекта.ПолноеИмя());
	
	// пробуем получить собственные печатные формы
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ВнешниеПечатныеФормы.Обработка КАК Обработка,
	               |	CW_ВнешниеПечатныеФормы.Наименование КАК Наименование
	               |ИЗ
	               |	РегистрСведений.CW_ВнешниеПечатныеФормы КАК CW_ВнешниеПечатныеФормы
	               |ГДЕ
	               |	CW_ВнешниеПечатныеФормы.Метаданное = &Метаданное
	               |	И CW_ВнешниеПечатныеФормы.Обработка.НеИспользуется = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	CW_ВнешниеПечатныеФормы.Обработка.Наименование";
	
	Запрос.УстановитьПараметр("Метаданное", Метаданное);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();

	Пока Выборка.Следующий() Цикл
		
		// добавляем
		НоваяСтрока = ТаблицаМакетов.Добавить();
		НоваяСтрока.ВидОбработки 		= "Внешняя";
		НоваяСтрока.СсылкаНаОбработку 	= Выборка.Обработка;
		НоваяСтрока.Представление 		= Выборка.Наименование;
		
	КонецЦикла; 
	
	Возврат(ТаблицаМакетов);
	
КонецФункции // 

Функция ПолучитьПечатнуюФорму(Ссылка, ВидОбработки, ОбработкаПФ , ИгнорироватьУловияИспользования=Ложь, Настройка=Неопределено, ДляРассылки = Ложь, КонтекстВызова=Неопределено, ПодписьИПечать=Ложь) Экспорт
	
	Попытка
		
		Если ВидОбработки = "СтандартнаяВнешняя" Тогда
			
			// условие не выполняется никогда
			Если ОбработкаПФ = Неопределено Тогда
				СПФ = _сф.ст_Создать();
				СПФ.Вставить("Использование",Ложь);
				СПФ.Вставить("Ошибка",Истина);
				СПФ.Вставить("ОписаниеОшибки",Строка(Ссылка)+": ошибка получения обработки из хранилища.");
				
				Возврат(СПФ);
				
			КонецЕсли;
			
			// пишем обработку на диск и запускаем ее на выполнение...
			ИмяФайла = ПолучитьИмяВременногоФайла("epf");
			ОбработкаПФ.Записать(ИмяФайла);
			Обработка = ВнешниеОбработки.Создать(ИмяФайла);
			
		
		ИначеЕсли ВидОбработки = "Внешняя" Тогда
			
			Если ОбработкаПФ = Неопределено Тогда
				
				СПФ = _сф.ст_Создать();
				СПФ.Вставить("Использование",Ложь);
				СПФ.Вставить("Ошибка",Истина);
				СПФ.Вставить("ОписаниеОшибки",Строка(Ссылка)+": ошибка получения обработки из хранилища.");
				
				Возврат(СПФ);
				
			КонецЕсли;
			
			// пишем обработку на диск и запускаем ее на выполнение...
			Обработка = _ПО.ПолучитьОбработку(ОбработкаПФ);
			
		ИначеЕсли ВидОбработки = "Внутренняя" Тогда
			
			// условие не выполняется никогда
			Обработка = Обработки[ОбработкаПФ].Создать();
			
		КонецЕсли; 
		
		Обработка.СсылкаНаОбъект = Ссылка;
		
		// проверяем использование
		Попытка
			Использование = Обработка.Использование(ОбработкаПФ);
		Исключение
		   	Использование = Обработка.Использование();
		КонецПопытки; 
		
		ИспользованиеВКонтексте = Истина;
		Если КонтекстВызова <> Неопределено Тогда
			Попытка
				ИспользованиеВКонтексте = Обработка.ИспользованиеВКонтексте(КонтекстВызова);
			Исключение
				ИспользованиеВКонтексте = Ложь;
			КонецПопытки; 
		КонецЕсли;
				
		Если Использование И ИспользованиеВКонтексте ИЛИ ИгнорироватьУловияИспользования Тогда  
			
			Параметры = CW_ПодключаемыеКомандыСервер.НоваяСтруктураНастроекПечати();
			Параметры.ПодключаемыйОбъект 	= ОбработкаПФ;
			Параметры.ШаблонПредставления 	= ОбработкаПФ.ШаблонПредставленияПечатнойФормы;
			Параметры.ДляРассылки 			= ДляРассылки;
			Параметры.ПодписьИПечать 		= ПодписьИПечать;
			Параметры.Настройки 			= _ПО.ПолучитьНастройкиОбработки(ОбработкаПФ);

			СПФ = Обработка.ПечатнаяФорма(Параметры);
			СПФ.Вставить("Использование",Использование); 
			
		Иначе
			
			СПФ = _сф.ст_Создать();
			СПФ.Вставить("Использование", Использование И ИспользованиеВКонтексте);
			
		КонецЕсли; 
		
		Если ВидОбработки = "СтандартнаяВнешняя" Тогда
			
			УдалитьФайлы(ИмяФайла);
			
		КонецЕсли;
		
	Исключение
		
		СПФ = _сф.ст_Создать();
		СПФ.Вставить("Использование",Ложь);
		СПФ.Вставить("Ошибка",Истина);
		СПФ.Вставить("ОписаниеОшибки",Строка(Ссылка)+": "+ОписаниеОшибки());
		
	КонецПопытки; 
	
	Возврат(СПФ);
	
КонецФункции

Процедура УстановитьПредставлениеПоШаблону(ПредставлениеПечатнойФрмы, НастройкиПечати, ДанныеДляЗаполнения) Экспорт
	
	Если НЕ НастройкиПечати.Свойство("ШаблонПредставления") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НастройкиПечати.ШаблонПредставления) Тогда
		Возврат;
	КонецЕсли;
	
	ПредставлениеПечатнойФрмы = НастройкиПечати.ШаблонПредставления;
	
	НомерДокумента = ДанныеДляЗаполнения.НомерДокумента;
	Если ДанныеДляЗаполнения.Свойство("НомерИсправления") Тогда
		НомерДокумента  = НомерДокумента + ?(ЗначениеЗаполнено(ДанныеДляЗаполнения.НомерИсправления), " (испр. "+Формат(ДанныеДляЗаполнения.НомерИсправления,"ЧГ=0")+")","")
	КонецЕсли;
	
	ПредставлениеПечатнойФрмы = СтрЗаменить(ПредставлениеПечатнойФрмы, "[НомерДокумента]", 				НомерДокумента);
	ПредставлениеПечатнойФрмы = СтрЗаменить(ПредставлениеПечатнойФрмы, "[ДатаДокумента, dd.MM.yyyy]", 	Формат(ДанныеДляЗаполнения.ДатаДокумента, "ДФ=dd.MM.yyyy"));
	ПредставлениеПечатнойФрмы = СтрЗаменить(ПредставлениеПечатнойФрмы, "[ДатаДокумента, dd.MM.yy]", 	Формат(ДанныеДляЗаполнения.ДатаДокумента, "ДФ=dd.MM.yy"));
	
КонецПроцедуры

// Функция - Получить печать организации
//
// Параметры:
//  Организация			 - 	 Организация; 
//  ПодключаемыйОбъект	 - 	 ссылка на справочник "Подключаемые объекты" 
//  НаДату				 - 	 дата, на которую будет получена картинка печати; 
//  ВернутьКартинку		 - 	 Булево, признак возвращаемгого значнеия: картинка или двоичные данные;
// 
// Возвращаемое значение:
//   - Картинка, ДвоичныеДанные, Неопределено;
//
Функция ПолучитьПечатьОрганизации(Знач Организация, Знач ПодключаемыйОбъект=Неопределено, Знач НаДату=Неопределено, ВернутьКартинку=Истина) Экспорт
	
	НаДату = ?(ЗначениеЗаполнено(НаДату), НаДату, ТекущаяДата());
	
	Если ПодключаемыйОбъект <> Неопределено Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ВидыПечатей.ВидПечати КАК ВидПечати
		|ИЗ
		|	РегистрСведений.CW_ВидыПечатейПечатныхФорм КАК ВидыПечатей
		|ГДЕ
		|	ВидыПечатей.ПечатнаяФорма = &ПечатнаяФорма";   
		
		Запрос.УстановитьПараметр("ПечатнаяФорма", ПодключаемыйОбъект); 
		
		РезультатЗапроса = Запрос.Выполнить();
		Выборка = РезультатЗапроса.Выбрать();
		Если Выборка.Следующий() Тогда
			ВидПечати = Выборка.ВидПечати;
		КонецЕсли;  
		
	КонецЕсли;
	
	мВидыПечати = Новый Массив;
	мВидыПечати.Добавить(ПредопределенноеЗначение("Справочник.CW_ВидыПечатейОрганизаций.ПустаяСсылка"));
	
	Если ЗначениеЗаполнено(ВидПечати) Тогда 
		мВидыПечати.Добавить(ВидПечати);       
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	ПечатиОрганизаций.ВидПечати КАК ВидПечати,
	               |	ПечатиОрганизаций.ХранилищеПечати КАК ХранилищеПечати
	               |ИЗ
	               |	РегистрСведений.CW_ПечатиОрганизаций.СрезПоследних(
	               |			&ДатаСреза,
	               |			Организация = &Организация
	               |				И ВидПечати В (&ВидыПечати)) КАК ПечатиОрганизаций
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВидПечати УБЫВ";   
	
	Запрос.УстановитьПараметр("ДатаСреза", 		НаДату);
	Запрос.УстановитьПараметр("Организация", 	Организация);
	Запрос.УстановитьПараметр("ВидыПечати", 	мВидыПечати);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДвоичныеДанные = Выборка.ХранилищеПечати.Получить();
	КонецЕсли; 
	
	Если ДвоичныеДанные = Неопределено тогда  
		Если ВернутьКартинку Тогда
			Возврат Новый Картинка();
		КонецЕсли;   
		
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВернутьКартинку Тогда
		Возврат Новый Картинка(ДвоичныеДанные);
	КонецЕсли; 
	
	Возврат ДвоичныеДанные;
	
КонецФункции

Функция ПолучитьПодписьСотрудника(Знач Сотрудник, ВернутьКартинку = Истина) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 	"ВЫБРАТЬ
	|	CW_ПараметрыСотрудников.Подпись
	|ИЗ
	|	РегистрСведений.CW_ПараметрыСотрудников КАК CW_ПараметрыСотрудников
	|ГДЕ
	|	CW_ПараметрыСотрудников.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Сотрудник", Сотрудник);	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Если Выборка.Следующий() Тогда
		ДвоичныеДанные = Выборка.Подпись.Получить();
	КонецЕсли; 
	
	Если ДвоичныеДанные = Неопределено тогда  
		Если ВернутьКартинку Тогда
			Возврат Новый Картинка();
		КонецЕсли;   
		Возврат Неопределено;
	КонецЕсли;
	
	Если ВернутьКартинку Тогда
		Возврат Новый Картинка(ДвоичныеДанные);
	КонецЕсли; 
	
	Возврат ДвоичныеДанные;
	
КонецФункции


#КонецОбласти

Процедура ПодготовитьТаблицуУслуг(ТаблицаУслуг, Объект, ПараметрыДоговора, Источник, Корректировка = Ложь, ИмяПараметраВариантаСвертки = Неопределено, Язык = Неопределено, МодульЭДО=ложь) Экспорт 
	
	// если имя параметра "ВариантСвертки" неопределен,
	// то получаем его по имени источника
	Если ИмяПараметраВариантаСвертки = Неопределено Тогда
		Если (Источник = "счет") Тогда
			ИмяПараметраВариантаСвертки = "ВариантСверткиНоменклатурыДляСчетов";
		ИначеЕсли (Источник = "акт") Тогда
			ИмяПараметраВариантаСвертки = "ВариантСверткиНоменклатурыДляАктов";
		ИначеЕсли (Источник = "сф") Тогда
			ИмяПараметраВариантаСвертки = "ВариантСверткиНоменклатурыДляСФ";
		ИначеЕсли Источник = "ОтчетЭкспедитора" Тогда
			ИмяПараметраВариантаСвертки = "ВариантСверткиНоменклатурыДляОтчетаЭкспедитора";
		КонецЕсли; 
	КонецЕсли; 
	
	ТаблицаУслуг.Колонки.Добавить("НетСуммы", Новый ОписаниеТипов("Булево"));
	ТаблицаУслуг.Колонки.Добавить("НомерСтрокиУслуг");  
	ТаблицаУслуг.Колонки.Добавить("ДетализированныеСтроки"); 
	
	Для каждого Стр Из ТаблицаУслуг Цикл
		Стр.НомерСтрокиУслуг = ТаблицаУслуг.Индекс(Стр)+1;
		Если НЕ Корректировка Тогда
			Стр.НетСуммы = (Стр.Всего = 0);
		КонецЕсли;
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоОтбору(ТаблицаУслуг, _сф.ст_Отбор("НетСуммы", Истина));
	
	Если ИмяПараметраВариантаСвертки <> Неопределено Тогда
		Если НЕ ПараметрыДоговора[ИмяПараметраВариантаСвертки].Пустая() Тогда
			ВариантСвертки = ПараметрыДоговора[ИмяПараметраВариантаСвертки];
			
			//Подсистема.СверткаТабличныхЧастей
			СоответствиеДополнительныхПолей = CW_СверткаТабличныхЧастей.ДополнитьДополнительныеПоляСвертки(ТаблицаУслуг, ВариантСвертки, Истина);
			//Подсистема.СверткаТабличныхЧастей
		
			ТаблицаЗамены = ВариантСвертки.ТаблицаЗамены.Выгрузить();
			Если ТаблицаЗамены.Количество() <> 0 Тогда
				ТаблицаЗамены.Свернуть("ЗаменяемаяНоменклатура,Номенклатура");
				
				//Определяем общую замену
				ОтборПустыхЗамен = Новый Структура("ЗаменяемаяНоменклатура", Справочники.Номенклатура.ПустаяСсылка());
				мОбщаяЗамена  		= ТаблицаЗамены.НайтиСтроки(ОтборПустыхЗамен);
				УказанаОбщаяЗамена	= Ложь;
				Если мОбщаяЗамена.Количество()>0 Тогда
					ОбщаяНоменклатураЗамены	= мОбщаяЗамена[0].Номенклатура;
					УказанаОбщаяЗамена	= Истина;
				Конецесли;
				//Определяем общую замену
				
				СоответствиеЗамены = _сф.со_Создать("ЗаменяемаяНоменклатура", "Номенклатура", ТаблицаЗамены);
				Для Каждого Стр Из ТаблицаУслуг Цикл
					НоменклатураЗамены = СоответствиеЗамены.Получить(Стр.Номенклатура);
					Если ЗначениеЗаполнено(НоменклатураЗамены) Тогда
						Стр.Номенклатура = НоменклатураЗамены;
					ИначеЕсли УказанаОбщаяЗамена Тогда
						Стр.Номенклатура = ОбщаяНоменклатураЗамены;
					КонецЕсли; 
				КонецЦикла; 
			КонецЕсли;  
			
			ТаблицаШаблонов = ВариантСвертки.НоменклатураСвертки.Выгрузить();
			
			//Определяем общий шаблон
			ОтборПустыхШаблонов = Новый Структура("Номенклатура", Справочники.Номенклатура.ПустаяСсылка());
			мОбщийШаблон  		= ТаблицаШаблонов.НайтиСтроки(ОтборПустыхШаблонов);
			УказанОбщийШаблон	= Ложь;
			Если мОбщийШаблон.Количество()>0 Тогда
				ОбщийШаблон			= мОбщийШаблон[0];
				УказанОбщийШаблон	= Истина;
			Конецесли;
			//Определяем общий шаблон
			
			//Готовим массив услуг для поиска шаблонов
			времТаблицаУслуг = ТаблицаУслуг.Скопировать(,"Номенклатура");
			времТаблицаУслуг.Свернуть("Номенклатура");
			мУслуги 		=  времТаблицаУслуг.ВыгрузитьКолонку("Номенклатура");
			
			Для каждого НоменклатураМассива из мУслуги Цикл
				
				Отбор = Новый Структура("Номенклатура",НоменклатураМассива);
				
				СтрокаШаблона = ТаблицаШаблонов.Найти(НоменклатураМассива, "Номенклатура");
				
				Если СтрокаШаблона = Неопределено и УказанОбщийШаблон Тогда
					СтрокаШаблона = ОбщийШаблон;
				КонецЕсли;
				
				Если СтрокаШаблона = Неопределено Тогда
					Продолжить;
				КонецЕсли;
				
				//Подсистема.СверткаТабличныхЧастей
				СтрокаДополнительныхПолей= СоответствиеДополнительныхПолей.Получить(НоменклатураМассива);
				СтрокаДополнительныхПолей = ?(СтрокаДополнительныхПолей = Неопределено, "", СтрокаДополнительныхПолей);
				//Подсистема.СверткаТабличныхЧастей
				
				//Готовим массив услуг для поиска шаблонов
				РасчитыватьЦенуПослеСвертки 	= СтрокаШаблона.РасчитыватьЦенуПослеСвертки;
				СворачиватьПоДокументуРасходов 	= СтрокаШаблона.СворачиватьПоДокументуРасходов;
				
				Мстр  = ТаблицаУслуг.НайтиСтроки(Отбор);
				
				Если СтрокаШаблона.РежимСверткиСтроки = 0 Тогда //Сворачиваем
					Для Каждого СтрокаМассва из Мстр Цикл
						СтрокаМассва.НомерСтрокиУслуг = 0;
					КонецЦикла;
				КонецЕсли;
				
				кэшТаблицаУслуг = ТаблицаУслуг.Скопировать(Отбор);

				Если Мстр.Количество() <> 0 Тогда
					
					ИндексПервойСтроки = ТаблицаУслуг.Индекс(_сф.к_ПервыйЭлемент(Мстр));
					ТаблицаПоНоменклатуре = ТаблицаУслуг.Скопировать(Отбор);
					_сф.к_УдалитьЭлементыПоОтбору(ТаблицаУслуг, Отбор);
					
					СтрокаСвертки = "НомерСтрокиУслуг,Номенклатура,СтавкаНДС";
					Если НЕ РасчитыватьЦенуПослеСвертки Тогда 
						СтрокаСвертки = СтрокаСвертки + ",Цена,Цена_Рег";
					КонецЕсли;        
					
					Если Корректировка Тогда 
						Если Не МодульЭДО Тогда 
							СтрокаСвертки =  СтрокаСвертки + ",ПК_Цена,ПК_Цена_Рег";
						Иначе
							СтрокаСвертки = СтрокаСвертки + ",Цена_ДоКорректировки,Цена_ПередКорректировкой";
						КонецЕсли;             
					КонецЕсли;
					
					Если СворачиватьПоДокументуРасходов Тогда 
						СтрокаСвертки = СтрокаСвертки + ",ДокументРасходов";
					КонецЕсли;   
					
					//Подсистема.СверткаТабличныхЧастей
					СтрокаСвертки = СтрокаСвертки +","+ СтрокаДополнительныхПолей;
					//Подсистема.СверткаТабличныхЧастей
					
					ТаблицаГруппировки = ТаблицаПоНоменклатуре.Скопировать(, СтрокаСвертки);
					ТаблицаГруппировки.Свернуть(СтрокаСвертки);
					
					Для Каждого Группировка Из ТаблицаГруппировки Цикл
						
						ОтборПоГруппировке = _сф.ст_Создать(СтрокаСвертки, Группировка);
						ТаблицаТекущейГруппировки = ТаблицаПоНоменклатуре.Скопировать(ОтборПоГруппировке);
						
						Если ИндексПервойСтроки + 1 > ТаблицаУслуг.Количество() Тогда
							Нстр = ТаблицаУслуг.Добавить();
						Иначе
							Нстр = ТаблицаУслуг.Вставить(ИндексПервойСтроки);
						КонецЕсли; 
						_сф.Инкремент(ИндексПервойСтроки);
						
						мСтрокиУслуг = кэшТаблицаУслуг.Найтистроки(ОтборПоГруппировке);
						Если мСтрокиУслуг.Количество() > 0 Тогда
							НайденнаяСтрока = мСтрокиУслуг[0];
							ПредставлениеБезШаблона = НайденнаяСтрока.Представление;
						КонецЕсли;

						
						Если Язык = Неопределено Тогда
							Язык = ПараметрыДоговора.ЯзыкПечатиДокументов;
						КонецЕсли;
						
						Если (Язык  = 0) Тогда
							Если ЗначениеЗаполнено(СтрокаШаблона.Шаблон) Тогда
								Нстр.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.Шаблон,Объект,, ТаблицаТекущейГруппировки);
							Иначе
								Нстр.Представление = ПредставлениеБезШаблона;
							КонецЕсли;
						ИначеЕсли (Язык  = 1) Тогда 
							Если ЗначениеЗаполнено(СтрокаШаблона.ШаблонАнглийский) Тогда
								Нстр.Представление = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.ШаблонАнглийский,Объект,, ТаблицаТекущейГруппировки);
							Иначе
								Нстр.Представление = ПредставлениеБезШаблона;
							КонецЕсли;
						ИначеЕсли (Язык = 2) Тогда 
							
							Если ЗначениеЗаполнено(СтрокаШаблона.Шаблон) Тогда
								ТекстНаРусском = CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.Шаблон,Объект,,ТаблицаТекущейГруппировки); 
							Иначе
								ТекстНаРусском =  ПредставлениеБезШаблона;
							КонецЕсли;
							
							Если ЗначениеЗаполнено(СтрокаШаблона.ШаблонАнглийский) Тогда
								ТекстНаАнглийском 	= CW_Шаблоны.ОбработатьШаблонНоменклатуры(СтрокаШаблона.ШаблонАнглийский,Объект,,ТаблицаТекущейГруппировки);
							Иначе
								Если ПустаяСтрока(ТекстНаРусском) Тогда
									ТекстНаРусском =  ПредставлениеБезШаблона;
								КонецЕсли;
							КонецЕсли;
							
							мТексты = Новый Массив;
							Если Не ПустаяСтрока(ТекстНаРусском) Тогда
								мТексты.Добавить(ТекстНаРусском);
							КонецЕсли;
							Если Не ПустаяСтрока(ТекстНаАнглийском) Тогда
								мТексты.Добавить(ТекстНаАнглийском);
							КонецЕсли;
							
							Нстр.Представление = СтрСоединить(мТексты," / ");
							
						КонецЕсли; 
						
						Если СтрокаШаблона.СуммированиеКоличества = Перечисления.CW_ВариантыСуммированияКоличества.КоличествоГП Тогда
							ТабКолГП = ТаблицаТекущейГруппировки.Скопировать();
							ТабКолГП.Свернуть("ПредставлениеГП");
						КонецЕсли;	
						
						Если (НЕ Корректировка) Тогда
							РесурсыСвертки = "Количество,Сумма,НДС,Всего,Сумма_Рег,НДС_Рег,Всего_Рег";
						Иначе    
							РесурсыСвертки = "Количество,Сумма,НДС,Всего,Сумма_Рег,НДС_Рег,Всего_Рег"+",";
							Если Не МодульЭДО Тогда
								РесурсыСвертки = РесурсыСвертки + "ПК_Количество,ПК_Сумма,ПК_НДС,ПК_Всего,ПК_Сумма_Рег,ПК_НДС_Рег,ПК_Всего_Рег";
							Иначе
								РесурсыСвертки = РесурсыСвертки + "Количество_ПередКорректировкой,Сумма_ПередКорректировкой,НДС_ПередКорректировкой,Всего_ПередКорректировкой,Сумма_ПередКорректировкой";
							КонецЕсли;
							РесурсыСвертки = РесурсыСвертки + ",Всего_ДоКорректировки,Количество_ДоКорректировки,НДС_ДоКорректировки,Сумма_ДоКорректировки";
						КонецЕсли;   
						
						//AFR-260057 
						ТаблицаКопияДоСвертки = ТаблицаТекущейГруппировки.Скопировать();  
						//AFR-260057 
						
						ТаблицаТекущейГруппировки.Свернуть(СтрокаСвертки, РесурсыСвертки);    
						ЗаполнитьЗначенияСвойств(Нстр, _сф.к_ПервыйЭлемент(ТаблицаТекущейГруппировки));  
						
						//AFR-260057 
						Нстр.ДетализированныеСтроки = ТаблицаКопияДоСвертки; // добавляем колонку со свернутыми строками
						//AFR-260057
						
						Если НайденнаяСтрока <> Неопределено и Корректировка Тогда
							Нстр.СтавкаНДС_ДоКорректировки = НайденнаяСтрока.СтавкаНДС_ДоКорректировки;
						КонецЕсли;
						
						Если СтрокаШаблона.СуммированиеКоличества = Перечисления.CW_ВариантыСуммированияКоличества.Равно1 Тогда
							Нстр.Количество = 1;
							Если (Корректировка) Тогда 
								Если Не МодульЭДО Тогда
									Нстр.ПК_Количество = 1;
								Иначе
									Нстр.Количество_ПередКорректировкой = 1;
								КонецЕсли;
							КонецЕсли; 
						КонецЕсли; 
						
						Если СтрокаШаблона.СуммированиеКоличества = Перечисления.CW_ВариантыСуммированияКоличества.КоличествоГП Тогда
							Нстр.Количество = ТабКолГП.Количество();
							Если (Корректировка) Тогда
								Если Не МодульЭДО Тогда
									Нстр.ПК_Количество = ТабКолГП.Количество();    
								Иначе
									Нстр.Количество_ПередКорректировкой = ТабКолГП.Количество();    
								КонецЕсли;
							КонецЕсли; 
						КонецЕсли;	
						
						Если РасчитыватьЦенуПослеСвертки Тогда
							Нстр.Цена = _сф.БезопасноРазделить(Нстр.Сумма,Нстр.Количество);
							Нстр.Цена_Рег = _сф.БезопасноРазделить(Нстр.Сумма_Рег,Нстр.Количество);
							Если (Корректировка) Тогда
								Если Не МодульЭДО Тогда
									Нстр.ПК_Цена = _сф.БезопасноРазделить(Нстр.ПК_Сумма,Нстр.ПК_Количество);
									Нстр.ПК_Цена_Рег = _сф.БезопасноРазделить(Нстр.ПК_Сумма_Рег,Нстр.ПК_Количество);
								Иначе
									Нстр.Цена_ПередКорректировкой = _сф.БезопасноРазделить(Нстр.Сумма_ПередКорректировкой,Нстр.Количество_ПередКорректировкой);
								КонецЕсли;
							КонецЕсли; 
						Иначе
							Нстр.Цена 		= Группировка.Цена;      
							Нстр.Цена_Рег 	= Группировка.Цена_Рег;  
							
							Если Корректировка Тогда
								Если Не МодульЭДО Тогда
									Нстр.ПК_Цена 		= Группировка.ПК_Цена;
									Нстр.ПК_Цена_Рег 	= Группировка.ПК_Цена_Рег;
								Иначе
									Нстр.Цена_ПередКорректировкой = Группировка.Цена_ПередКорректировкой;
								КонецЕсли;       
							КонецЕсли; 
						КонецЕсли; 
						
					КонецЦикла; 
				КонецЕсли; 
			КонецЦикла; 
		КонецЕсли; 
	КонецЕсли; 
	
	
КонецПроцедуры

Функция ПолучитьШаблоныСверткиНоменклатуры(Номенклатура, ВаринатСверкти)
	
	мНоменклатура = Новый Массив;
	мНоменклатура.Добавить(Справочники.Номенклатура.ПустаяСсылка());
	мНоменклатура.Добавить(Номенклатура);
	
	Запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Номенклатура КАК ИскомаяНоменклатура,
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Шаблон КАК Шаблон,
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.ШаблонАнглийский КАК ШаблонАнглийский,
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.НеСуммироватьКоличество КАК НеСуммироватьКоличество,
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.СуммированиеКоличества КАК СуммированиеКоличества
	               |ИЗ
	               |	Справочник.CW_ВариантыСверткиТабличныхЧастей.НоменклатураСвертки КАК CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки
	               |ГДЕ
	               |	CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Ссылка = &ВаринатСверкти
	               |	И CW_ВариантыСверткиТабличныхЧастейНоменклатураСвертки.Номенклатура В(&мНоменклатура)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номенклатура";
	
	Запрос.УстановитьПараметр("ВаринатСверкти"	, ВаринатСверкти);
	Запрос.УстановитьПараметр("мНоменклатура"	, мНоменклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Возврат Выборка.Следующий();
	КонецЕсли ;
	
	Возврат Неопределено;
	
КонецФункции

Функция ФамилияИОИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество,Знач Дата=Неопределено) Экспорт 
	// Преобразует строку вида " Пупкин  Василий Иванович" в "Пупкин В.И."
	
	стр = СокрЛП(строкаФамилияИмяОтчество);
	
	Если (Дата = Неопределено) Тогда
		
		Дата = ТекущаяДата();
		
	КонецЕсли; 
	
	Если (ТипЗнч(строкаФамилияИмяОтчество)=Тип("СправочникСсылка.ФизическиеЛица")) Тогда
		
		// получаем через стандартный механзм БП
		СФЛ = ФизическиеЛицаЗарплатаКадры.ДанныеФизическогоЛицаДляРегламентированнойОтчетности(строкаФамилияИмяОтчество,,Дата); // ВызовБП
		Фамилия = СФЛ.Фамилия;
		Имя = СФЛ.Имя;
		Отчество = СФЛ.Отчество;
		
	Иначе
		
		// удалим двойные пробелы
		Пока Найти(стр, "  ")>0 Цикл
			стр = СтрЗаменить(стр, "  ", " ");
		КонецЦикла;
		
		// разделим на [три] строки
		стр = СтрЗаменить(стр, " ", Символы.ПС);
		
		Фамилия  = СтрПолучитьСтроку(стр, 1);
		Имя      = "";
		Отчество = "";
		
		Если СтрЧислоСтрок(стр) >= 2 Тогда 
			Имя = СтрПолучитьСтроку(стр, 2);
		КонецЕсли;
		
		Если СтрЧислоСтрок(стр) >= 3 Тогда 
			Отчество = СтрПолучитьСтроку(стр, 3);
		КонецЕсли;
		
	КонецЕсли; 
	
	ФамилияИО = ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + 
				?(НЕ ПустаяСтрока(Отчество) , 
				Лев(Отчество,1)+".", ""), ""), "");
	
	Возврат ФамилияИО;
	
КонецФункции

Функция ФамилияИО_или_ФамилияИмя_ИзСтрокиФамилияИмяОтчество(строкаФамилияИмяОтчество) Экспорт 
	// Преобразует строку вида " Пупкин  Василий Иванович" в "Пупкин В.И.", но " Пупкин  Василий" в "Пупкин Василий"
	
	стр = СокрЛП(строкаФамилияИмяОтчество);
	
	// удалим двойные пробелы
	Пока Найти(стр, "  ")>0 Цикл
		стр = СтрЗаменить(стр, "  ", " ");
	КонецЦикла;
	
	// разделим на [три] строки
	стр = СтрЗаменить(стр, " ", Символы.ПС);
	
	Фамилия  = СтрПолучитьСтроку(стр, 1);
	Имя      = "";
	Отчество = "";
	
	Если СтрЧислоСтрок(стр) >= 2 Тогда 
		Имя = СтрПолучитьСтроку(стр, 2);
	КонецЕсли;
	
	Если СтрЧислоСтрок(стр) = 2 Тогда 
		Возврат Фамилия+" "+Имя;
	КонецЕсли;
	
	Если СтрЧислоСтрок(стр) >= 3 Тогда 
		Отчество = СтрПолучитьСтроку(стр, 3);
	КонецЕсли;
	
	ФамилияИО = ?(НЕ ПустаяСтрока(Фамилия), Фамилия + ?(НЕ ПустаяСтрока(Имя)," " + Лев(Имя,1) + "." + 
				?(НЕ ПустаяСтрока(Отчество) , 
				Лев(Отчество,1)+".", ""), ""), "");
	
	Возврат ФамилияИО;
	
КонецФункции

Функция СформироватьСуммуПрописьюАнгл(Сумма, Валюта) Экспорт

	// ВызовБП
	соотв=Новый Соответствие();
	соотв.Вставить("840", "dollar, dollars, cent, cents, 2");
	соотв.Вставить("978", "EURO, EURO, Cent, Cents, 2");
	соотв.Вставить("643", "ruble, rubles, cop, cops, 2"); 
	соотв.Вставить("156", "yuan, yuan, jiao, jiao, 2"); 
	
	соотв.Вставить("USD", "dollar, dollars, cent, cents, 2");
	соотв.Вставить("EUR", "EURO, EURO, Cent, Cents, 2");
	соотв.Вставить("RUB", "ruble, rubles, cop, cops, 2"); 
	соотв.Вставить("CNY", "yuan, yuan, jiao, jiao, 2"); 
	

	ПараметрыПрописиНаАнглийском = соотв[Валюта.Код];
	
	Если НЕ ЗначениеЗаполнено(ПараметрыПрописиНаАнглийском) Тогда
		Возврат(ОбщегоНазначенияБПВызовСервера.ФорматСумм(Сумма)); // ВызовБП
	Иначе
		Возврат(ЧислоПрописью(Сумма, "L=en_US", ПараметрыПрописиНаАнглийском));
	КонецЕсли;

КонецФункции

Функция ВернутьПодписантов(Ссылка, ПараметрыДоговора) Экспорт
	
	// подготовим структуру для возврата
	Ответ = Новый Структура;
	
	Ответ.Вставить("Руководитель",             ""); // должностное лицо, подписывающее документ
	Ответ.Вставить("РуководительПоДоговору",   ""); // должностное лицо, подписавшее договор
	Ответ.Вставить("РуководительДолжностьРус", "");
	Ответ.Вставить("РуководительДолжностьАнг", "");
	Ответ.Вставить("РуководительОснованиеРус", "");
	Ответ.Вставить("РуководительОснованиеАнг", "");

	Ответ.Вставить("ГлБух",             "");
	Ответ.Вставить("ГлБухОснованиеРус", "");
	Ответ.Вставить("ГлБухОснованиеАнг", "");
	
	Ответ.Вставить("ОтветственныйЗаОформление",             "");
	Ответ.Вставить("ОтветственныйЗаОформлениеОснованиеРус", "");
	Ответ.Вставить("ОтветственныйЗаОформлениеОснованиеАнг", "");
	Ответ.Вставить("ОтветственныйЗаОформлениеДолжность",    "");
	
	// получим должностных лиц по договору
	
	
	Если ПараметрыДоговора.РежимПодписей = 0 Тогда
		
		ВладелецПараметров = ПараметрыДоговора.Договор;
		Если ТипЗнч(ВладелецПараметров) = Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам") Тогда
			Организация = ВладелецПараметров.Организация;
		Иначе
			Организация = ВладелецПараметров.Договор.Организация;
		КонецЕсли;
		
		ДанныеОтветственных = РегистрыСведений.CW_ПараметрыДоговоров.ПолучитьОтветственныхЛицИзКарточкиОрганизации(Организация, Ссылка.Дата);
		
		Ответ.Вставить("Руководитель",              ДанныеОтветственных.РуководительОрганизации);
		Ответ.Вставить("РуководительПоДоговору",	ДанныеОтветственных.РуководительОрганизации);
		Ответ.Вставить("РуководительДолжностьРус",	ДанныеОтветственных.ДолжностьРуководителя);
		
		Ответ.Вставить("ГлБух",						ДанныеОтветственных.ГлавныйБухгалтер);
		
		// фиксированные подписанты
	ИначеЕсли ПараметрыДоговора.РежимПодписей = 1 Тогда
		
		// руководитель
		Ответ.Вставить("Руководитель",             ПараметрыДоговора.РуководительОрганизации);
		Ответ.Вставить("РуководительПоДоговору",   ПараметрыДоговора.РуководительОрганизации);
		Ответ.Вставить("РуководительДолжностьРус", ПараметрыДоговора.ДолжностьРуководителяОрганизации);
		Ответ.Вставить("РуководительДолжностьАнг", ПараметрыДоговора.ДолжностьРуководителяОрганизацииАнгл);
		Ответ.Вставить("РуководительОснованиеРус", ПараметрыДоговора.РуководительОснование);
		Ответ.Вставить("РуководительОснованиеАнг", ПараметрыДоговора.РуководительОснованиеАнгл);	
		
		// главный бухгалтер				
		Ответ.Вставить("ГлБух",             ПараметрыДоговора.ГлавныйБухгалтерОрганизации);
		Ответ.Вставить("ГлБухОснованиеРус", ПараметрыДоговора.ГлавныйБухгалтерОснование);
		Ответ.Вставить("ГлБухОснованиеАнг", ПараметрыДоговора.ГлавныйБухгалтерОснованиеАнгл);	
		
	// динамические подписанты
	ИначеЕсли ПараметрыДоговора.РежимПодписей = 2 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.Руководитель,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжность,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительДолжностьАнгл,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснование,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.РуководительОснованиеАнгл,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтер,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснование,
			|	CW_ЛицаПодписывающиеДокументыСрезПоследних.ГлБухгалтерОснованиеАнгл
			|ИЗ
			|	РегистрСведений.CW_ЛицаПодписывающиеДокументы.СрезПоследних(
			|			&Дата,
			|			Вариант = &Вариант
			|				И Организация = &Организация) КАК CW_ЛицаПодписывающиеДокументыСрезПоследних";
		Запрос.УстановитьПараметр("Вариант", ПараметрыДоговора.ВариантПодписей);
		Запрос.УстановитьПараметр("Организация", Ссылка.Организация);
		Запрос.УстановитьПараметр("Дата", Ссылка.Дата);
		
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			
			Ответ.Вставить("Руководитель",             Выборка.Руководитель);
			Ответ.Вставить("РуководительПоДоговору",   Выборка.Руководитель);
			Ответ.Вставить("РуководительДолжностьРус", Выборка.РуководительДолжность);
			Ответ.Вставить("РуководительДолжностьАнг", Выборка.РуководительДолжностьАнгл);
			Ответ.Вставить("РуководительОснованиеРус", Выборка.РуководительОснование);
			Ответ.Вставить("РуководительОснованиеАнг", Выборка.РуководительОснованиеАнгл);
			
			Ответ.Вставить("ГлБух",             Выборка.ГлБухгалтер);
			Ответ.Вставить("ГлБухОснованиеРус", Выборка.ГлБухгалтерОснование);
			Ответ.Вставить("ГлБухОснованиеАнг", Выборка.ГлБухгалтерОснованиеАнгл);
		КонецЕсли;	
	КонецЕсли; // варианты подписантов по договору	
	
	// если подписанты требуются для документа "Доходы по грузоперевозке",
	// то в нем на закладке "Подписи" могут быть указаны иные подписанты
	Если (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке")) Тогда
		
		// руководитель
		Если (ЗначениеЗаполнено(Ссылка.Руководитель)) Тогда
			
			Ответ.Вставить("Руководитель",             Ссылка.Руководитель);
			//Ответ.Вставить("РуководительДолжностьРус", "Руководитель");
			//Ответ.Вставить("РуководительДолжностьАнг", "C.E.O.");
			Ответ.Вставить("РуководительОснованиеРус", Ссылка.ЗаРуководителяПоПриказу);
			Ответ.Вставить("РуководительОснованиеАнг", Ссылка.ЗаРуководителяПоПриказу);
		КонецЕсли; 
		
		// главный бухгалтер		
		Если (ЗначениеЗаполнено(Ссылка.ГлавныйБухгалтер)) Тогда
			
			Ответ.Вставить("ГлБух",             Ссылка.ГлавныйБухгалтер);
			Ответ.Вставить("ГлБухОснованиеРус", Ссылка.ЗаГлавногоБухгалтераПоПриказу);
			Ответ.Вставить("ГлБухОснованиеАнг", Ссылка.ЗаГлавногоБухгалтераПоПриказу);	
		КонецЕсли; 
		
		// Ответственный за оформление		
		Если (ЗначениеЗаполнено(Ссылка.ОтветственныйЗаОформление)) Тогда
			Ответ.Вставить("ОтветственныйЗаОформление", 			Ссылка.ОтветственныйЗаОформление);
			Ответ.Вставить("ОтветственныйЗаОформлениеОснованиеРус",	Ссылка.ОтветственныйЗаОформлениеПоПриказу);
			Ответ.Вставить("ОтветственныйЗаОформлениеОснованиеАнг",	Ссылка.ОтветственныйЗаОформлениеПоПриказу);	
			
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК Должность
			|ИЗ
			|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
			|			&ДатаСреза,
			|			ОтветственноеЛицо = ЗНАЧЕНИЕ(Перечисление.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОформление)
			|				И ФизическоеЛицо = &ФизическоеЛицо) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
			
			Запрос.УстановитьПараметр("ФизическоеЛицо", Ссылка.ОтветственныйЗаОформление);
			Запрос.УстановитьПараметр("ДатаСреза", 		Ссылка.Дата);
			
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Если Выборка.Следующий() Тогда
				Ответ.Вставить("ОтветственныйЗаОформлениеДолжность",   Выборка.Должность);
			КонецЕсли;
			
		Иначе
			Ответ.Вставить("ОтветственныйЗаОформление", 				Ссылка.ГлавныйБухгалтер);
			Ответ.Вставить("ОтветственныйЗаОформлениеОснованиеРус",		Ссылка.ЗаГлавногоБухгалтераПоПриказу);
			Ответ.Вставить("ОтветственныйЗаОформлениеОснованиеАнг",		Ссылка.ЗаГлавногоБухгалтераПоПриказу);	
			Ответ.Вставить("ОтветственныйЗаОформлениеДолжность",   		"Главный бухгалтер");
		КонецЕсли; 
		
	ИначеЕсли (ТипЗнч(Ссылка) = Тип("ДокументСсылка.CW_ОтчетЭкспедитора")) Тогда 
		
		// руководитель
		Если (ЗначениеЗаполнено(Ссылка.Руководитель)) Тогда
			Ответ.Вставить("Руководитель",             Ссылка.Руководитель);
			Ответ.Вставить("РуководительОснованиеРус", Ссылка.Руководитель_основание);
		КонецЕсли; 
		
		// главный бухгалтер		
		Если (ЗначениеЗаполнено(Ссылка.ГлавныйБухгалтер)) Тогда
			Ответ.Вставить("ГлБух",             Ссылка.ГлавныйБухгалтер);
			Ответ.Вставить("ГлБухОснованиеРус", Ссылка.ГлавныйБухгалтер_основание);
		КонецЕсли; 

	КонецЕсли; // если подписанты требуются для документа "Доходы по грузоперевозке" 
	
	Возврат(Ответ);
	
КонецФункции

#Область ОбработчикиОбщейКомандыПечати

Функция ПолучитьПараметрыФормыПечати(МассивОбъектов,Знач УИД, ПодписьИПечать = Ложь) Экспорт
	
	ЕстьПечатныеФормы 	= Ложь;
	Корень 				= Новый Структура("Имя,Вид,Элементы","","Корень",Новый Массив);
	
	Если (ТипЗнч(МассивОбъектов)=Тип("Массив")) Тогда
		Если (_сф.Количество(МассивОбъектов) <> 0) Тогда
			ОбъектПечати = МассивОбъектов[0];	
		КонецЕсли; 
	КонецЕсли; 
	
	//----
	ЭлементГруппа = Новый Структура;
	ЭлементГруппа.Вставить("Ссылка"		, ОбъектПечати);
	ЭлементГруппа.Вставить("Имя"		, СокрЛП(ОбъектПечати));
	ЭлементГруппа.Вставить("Вид"		, "Группа");
	ЭлементГруппа.Вставить("Элементы"	, Новый Массив);
	
	Корень.Элементы.Добавить(ЭлементГруппа);
	
	ЗаполнитьДанныеПечатныхФормОбъекта(ОбъектПечати, ЭлементГруппа, ЕстьПечатныеФормы, ПодписьИПечать);
	//----
	
	Если ТипЗнч(ОбъектПечати)= Тип("ДокументСсылка.CW_ОтчетЭкспедитора") Тогда
		//Дополняем метаданые связанных документов
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент
		               |ИЗ
		               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
		               |ГДЕ
		               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
		               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен
		               |
		               |ОБЪЕДИНИТЬ ВСЕ
		               |
		               |ВЫБРАТЬ
		               |	CW_ОтчетЭкспедитораДокументыВознаграждения.Документ
		               |ИЗ
		               |	Документ.CW_ОтчетЭкспедитора.ДокументыВознаграждения КАК CW_ОтчетЭкспедитораДокументыВознаграждения
		               |ГДЕ
		               |	CW_ОтчетЭкспедитораДокументыВознаграждения.Ссылка = &ОтчетЭкспедитора
		               |	И CW_ОтчетЭкспедитораДокументыВознаграждения.Документ.Проведен
		               |
		               |УПОРЯДОЧИТЬ ПО
		               |	СвязанныйДокумент УБЫВ
		               |АВТОУПОРЯДОЧИВАНИЕ";
		
		Запрос.УстановитьПараметр("ОтчетЭкспедитора", ОбъектПечати);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		Выборка = РезультатЗапроса.Выбрать();
		
		Пока  Выборка.Следующий() Цикл
			
			ЭлементГруппа = Новый Структура;
			ЭлементГруппа.Вставить("Имя"		, СокрЛП(Выборка.СвязанныйДокумент));
			ЭлементГруппа.Вставить("Вид"		, "Группа");
			ЭлементГруппа.Вставить("Элементы"	, Новый Массив);
			
			Корень.Элементы.Добавить(ЭлементГруппа);
			
			ЗаполнитьДанныеПечатныхФормОбъекта(Выборка.СвязанныйДокумент, ЭлементГруппа, ЕстьПечатныеФормы, ПодписьИПечать, ОбъектПечати);
		КонецЦикла;
		
	КонецЕсли;

	Если Не ЕстьПечатныеФормы Тогда
		Возврат(_УФКС.Ответ(1,"Печатные формы не обнаружены!"));
	КонецЕсли;

	МассивСсылок = новый Массив;
	МассивСсылок.Добавить(ОбъектПечати);
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("АдресПакета"						,ПоместитьВоВременноеХранилище(Корень		,УИД));
	ПараметрыФормыПечати.Вставить("АдресОбъектовПечати"				,ПоместитьВоВременноеХранилище(МассивСсылок	,УИД));
	ПараметрыФормыПечати.Вставить("ЗакрыватьПриЗакрытииВладельца"	,Истина);
	ПараметрыФормыПечати.Вставить("АдресСписокПФ"					,"");
	ПараметрыФормыПечати.Вставить("ЭтоПакетнаяПечать"				,Ложь);

	
	Ответ = _УФКС.Ответ();
	Ответ.Вставить("ПФ",ПараметрыФормыПечати);
	
	Возврат(Ответ);
	
	// --- 
КонецФункции

Функция ПолучитьПараметрыФормыПакетнойПечати(ПараметрыПечати, Знач УИД, СписокПФ, ПодписьИПечать = Ложь) Экспорт
	
	ТаблицаПФ = CW_Печать.ПолучитьПустуюТаблицуПечатныхФорм();
	
	CW_Печать.ЗаполнитьТаблицуПечатныхФормОбъектов(ПараметрыПечати.МассивИменМетаданных, ТаблицаПФ);
	
	МассивСсылок = Новый Массив;
	
	// получаем таблицу макетов
	МассивУдаления = Новый Массив;
	Для каждого Стр Из ТаблицаПФ Цикл
		
		Если (НЕ СписокПФ.НайтиПоЗначению(Стр.СсылкаНаОбработку).Пометка) Тогда
			МассивУдаления.Добавить(Стр);
		КонецЕсли; 
		
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаПФ, МассивУдаления);
	
	// если макетов нет - предупреждаем и выходим
	Если _сф.Количество(ТаблицаПФ)=0 Тогда
		
		// нужно вывести предупреждение
		Возврат(_УФКС.Ответ(1,"Печатные формы не обнаружены!"));
		
	КонецЕсли; 
	
	Корень = Новый Структура("Имя,Вид,Элементы","","Корень",Новый Массив);
	
	//идём по таблице, делаем доп. проверку и получаем табличные документы
	
	Для каждого ОбъектПечати Из ПараметрыПечати.ОбъектыПечати Цикл
		
		Документ = ОбъектПечати.Ссылка;
		
		МассивСсылок.Добавить(Документ); 
		
		ЭлементГруппа = Новый Структура;
		ЭлементГруппа.Вставить("Имя"		, СокрЛП(Документ));
		ЭлементГруппа.Вставить("Вид"		, "Группа");
		ЭлементГруппа.Вставить("Элементы"	, Новый Массив);
		
		Корень.Элементы.Добавить(ЭлементГруппа);
		
		Для каждого ПФ Из ТаблицаПФ Цикл
			
			Попытка
				
				Если (ПФ.ВидОбработки="СтандартнаяВнешняя") Тогда
					Обработка = ПФ.ДвоичныеДанные;
				ИначеЕсли (ПФ.ВидОбработки="Внешняя") Тогда 
					Обработка = ПФ.СсылкаНаОбработку;
				ИначеЕсли (ПФ.ВидОбработки="Внутренняя") Тогда 
					Обработка = ПФ.ИмяОбработки
				КонецЕсли; 
				
				СПФ = ПолучитьПечатнуюФорму(Документ,ПФ.ВидОбработки,Обработка,,,,,ПодписьИПечать);
				Если СПФ.Использование Тогда
					
					// формируем доп.параметры
					//ДопПараметры = _сф.ст_Создать("Источник");
					//ДопПараметры.Источник = Ссылка;
					
					Количество = 1;
					СПФ.Параметры.Свойство("Количество",Количество);
					
					ФлагПечати = Истина; 
					Если СПФ.Параметры.Свойство("Печать") Тогда
						ФлагПечати = СПФ.Параметры.Печать;
					КонецЕсли;
					
					Элемент = Новый Структура("Имя,Вид,ПФ,Количество,Печать,Ссылка",СПФ.Представление,"Элемент",СПФ.ПечатнаяФорма,Количество,ФлагПечати, Документ);
					
					Если СПФ.Свойство("ШаблонПисьма") Тогда
						Элемент.Вставить("ШаблонПисьма", СПФ.ШаблонПисьма);
					КонецЕсли;
					Если СПФ.Свойство("АдресЭлПочты") Тогда
						Элемент.Вставить("АдресЭлПочты", СПФ.АдресЭлПочты);
					КонецЕсли;
					Если СПФ.Свойство("АдресЭлПочтыКопия") Тогда
						Элемент.Вставить("АдресЭлПочтыКопия", СПФ.АдресЭлПочтыКопия);
					КонецЕсли;
					Если СПФ.Свойство("АдресЭлПочтыСкрытаяКопия") Тогда
						Элемент.Вставить("АдресЭлПочтыСкрытаяКопия", СПФ.АдресЭлПочтыСкрытаяКопия);
					КонецЕсли;
					Если СПФ.Свойство("ДанныеДляЗаполненияШаблона") Тогда
						Элемент.Вставить("ДанныеДляЗаполненияШаблона", СПФ.ДанныеДляЗаполненияШаблона);
					КонецЕсли;    
					
					Элемент.Вставить("НавигационнаяСсылка", 				ПолучитьНавигационнуюСсылку(Обработка));
					Элемент.Вставить("НавигационнаяСсылкаПредставление"	, 	Обработка.Наименование);
					
					ЭлементГруппа.Элементы.Добавить(Элемент);
					
				КонецЕсли; 
				
			Исключение
			КонецПопытки;
			
		КонецЦикла; 
		
		Если  ОбъектПечати.Свойство("СвязанныеДокументы")  Тогда
			
			Если ОбъектПечати.СвязанныеДокументы.Количество()ТОгда
				
				Для каждого Документ Из ОбъектПечати.СвязанныеДокументы Цикл
					
					МассивСсылок.Добавить(Документ); 
					
					ЭлементГруппаСвязанные = Новый Структура;
					ЭлементГруппаСвязанные.Вставить("Имя"		, СокрЛП(Документ));
					ЭлементГруппаСвязанные.Вставить("Вид"		, "Группа");
					ЭлементГруппаСвязанные.Вставить("Элементы"	, Новый Массив);
					
					ЭлементГруппа.Элементы.Добавить(ЭлементГруппаСвязанные);
					
					Для каждого ПФ Из ТаблицаПФ Цикл
						
						Попытка
							
							Если (ПФ.ВидОбработки="СтандартнаяВнешняя") Тогда
								Обработка = ПФ.ДвоичныеДанные;
							ИначеЕсли (ПФ.ВидОбработки="Внешняя") Тогда 
								Обработка = ПФ.СсылкаНаОбработку;
							ИначеЕсли (ПФ.ВидОбработки="Внутренняя") Тогда 
								Обработка = ПФ.ИмяОбработки
							КонецЕсли; 
							СПФ = ПолучитьПечатнуюФорму(Документ,ПФ.ВидОбработки,Обработка,,,,,ПодписьИПечать);
							Если СПФ.Использование Тогда
								
								// формируем доп.параметры
								//ДопПараметры = _сф.ст_Создать("Источник");
								//ДопПараметры.Источник = Ссылка;
								
								Количество = 1;
								СПФ.Параметры.Свойство("Количество",Количество);   
								
								ФлагПечати = Истина; 
								Если СПФ.Параметры.Свойство("Печать") Тогда
									ФлагПечати = СПФ.Параметры.Печать;
								КонецЕсли;
								
								Элемент = Новый Структура("Имя,Вид,ПФ,Количество,Печать,Ссылка",СПФ.Представление,"Элемент",СПФ.ПечатнаяФорма,Количество,ФлагПечати,Документ);
								
								Если СПФ.Свойство("ШаблонПисьма") Тогда
									Элемент.Вставить("ШаблонПисьма", СПФ.ШаблонПисьма);
								КонецЕсли;
								Если СПФ.Свойство("АдресЭлПочты") Тогда
									Элемент.Вставить("АдресЭлПочты", СПФ.АдресЭлПочты);
								КонецЕсли;
								Если СПФ.Свойство("АдресЭлПочтыКопия") Тогда
									Элемент.Вставить("АдресЭлПочтыКопия", СПФ.АдресЭлПочтыКопия);
								КонецЕсли;
								Если СПФ.Свойство("АдресЭлПочтыСкрытаяКопия") Тогда
									Элемент.Вставить("АдресЭлПочтыСкрытаяКопия", СПФ.АдресЭлПочтыСкрытаяКопия);
								КонецЕсли;
								Если СПФ.Свойство("ДанныеДляЗаполненияШаблона") Тогда
									Элемент.Вставить("ДанныеДляЗаполненияШаблона", СПФ.ДанныеДляЗаполненияШаблона);
								КонецЕсли;    
								
								Элемент.Вставить("НавигационнаяСсылка", 				ПолучитьНавигационнуюСсылку(Обработка));
								Элемент.Вставить("НавигационнаяСсылкаПредставление"	, 	Обработка.Наименование);
								
								// --- 
								ЭлементГруппаСвязанные.Элементы.Добавить(Элемент);
								
							КонецЕсли; 
							
						Исключение
						КонецПопытки;
						
					КонецЦикла; 
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
	КонецЦикла; 
	
	ПараметрыФормыПечати = Новый Структура;
	ПараметрыФормыПечати.Вставить("АдресПакета"						,ПоместитьВоВременноеХранилище(Корень		,УИД));
	ПараметрыФормыПечати.Вставить("АдресОбъектовПечати"				,ПоместитьВоВременноеХранилище(МассивСсылок	,УИД));
	ПараметрыФормыПечати.Вставить("АдресСписокПФ"					,ПоместитьВоВременноеХранилище(СписокПФ		,УИД));
	ПараметрыФормыПечати.Вставить("ЭтоПакетнаяПечать"				,истина);
	ПараметрыФормыПечати.Вставить("ЗакрыватьПриЗакрытииВладельца"	,Ложь);
	
	Ответ = _УФКС.Ответ();         
	Ответ.Вставить("ПФ",ПараметрыФормыПечати);
	
	Возврат(Ответ);
	
	// --- 
КонецФункции

Процедура ЗаполнитьДанныеПечатныхФормОбъекта(ОбъектПечати, ЭлементГруппа, ЕстьПечатныеФормы, ПодписьИПечать, КонтекстВызова= Неопределено )
	
	ФлагПечати 		= Истина;
	Количество 		= 1;
	ШаблонПисьма 	= Неопределено;
	АдресЭлПочты    = Неопределено;
	АдресЭлПочтыКопия    		= Неопределено;
	АдресЭлПочтыСкрытаяКопия 	= Неопределено;
	
	ДанныеДляЗаполненияШаблона 	= Неопределено;
	
	МассивИменМетаданных = Новый Массив;
	МассивИменМетаданных.Добавить(ОбъектПечати.Метаданные().ПолноеИмя());
	
	ТабПечатныхФорм = CW_Печать.ПолучитьПустуюТаблицуПечатныхФорм();
	CW_Печать.ЗаполнитьТаблицуПечатныхФормОбъектов(МассивИменМетаданных, ТабПечатныхФорм);

	//идём по таблице, делаем доп. проверку и получаем табличные документы
	Для каждого ПФ Из ТабПечатныхФорм Цикл
		
		Попытка
			
			Если (ПФ.ВидОбработки="СтандартнаяВнешняя") Тогда
				Обработка = ПФ.ДвоичныеДанные;
			ИначеЕсли (ПФ.ВидОбработки="Внешняя") Тогда 
				Обработка = ПФ.СсылкаНаОбработку;
			ИначеЕсли (ПФ.ВидОбработки="Внутренняя") Тогда 
				Обработка = ПФ.ИмяОбработки
			КонецЕсли; 
			
			СПФ = ПолучитьПечатнуюФорму(ОбъектПечати,ПФ.ВидОбработки,Обработка,,,,КонтекстВызова,ПодписьИПечать);
			
			Если СПФ.Использование Тогда
				
				ЕстьПечатныеФормы = Истина;
				// формируем доп.параметры
				//ДопПараметры = _сф.ст_Создать("Источник");
				//ДопПараметры.Источник = Ссылка;
				
				СПФ.Параметры.Свойство("Количество"	, Количество);
				СПФ.Параметры.Свойство("Печать"		, ФлагПечати);
				
				СПФ.Свойство("ШаблонПисьма"					, ШаблонПисьма);
				СПФ.Свойство("АдресЭлПочты"					, АдресЭлПочты);
				СПФ.Свойство("АдресЭлПочтыКопия"			, АдресЭлПочтыКопия);
				СПФ.Свойство("АдресЭлПочтыСкрытаяКопия"		, АдресЭлПочтыСкрытаяКопия);
				СПФ.Свойство("ДанныеДляЗаполненияШаблона"	, ДанныеДляЗаполненияШаблона);
				
				Элемент = Новый Структура;
				Элемент.Вставить("Имя"							, СПФ.Представление);
				Элемент.Вставить("Вид"							, "Элемент");
				Элемент.Вставить("ПФ"							, СПФ.ПечатнаяФорма);
				Элемент.Вставить("Количество"					, Количество);
				Элемент.Вставить("Печать"						, ФлагПечати);
				Элемент.Вставить("ШаблонПисьма"					, ШаблонПисьма);
				Элемент.Вставить("АдресЭлПочты"					, АдресЭлПочты);
				Элемент.Вставить("АдресЭлПочтыКопия"			, АдресЭлПочтыКопия);
				Элемент.Вставить("АдресЭлПочтыСкрытаяКопия"		, АдресЭлПочтыСкрытаяКопия);
				Элемент.Вставить("ДанныеДляЗаполненияШаблона"	, ДанныеДляЗаполненияШаблона);
				
				Элемент.Вставить("НавигационнаяСсылка", 				ПолучитьНавигационнуюСсылку(Обработка));
				Элемент.Вставить("НавигационнаяСсылкаПредставление"	, 	Обработка.Наименование);
				
				Элемент.Вставить("Ссылка", ОбъектПечати);
				
				ЭлементГруппа.Элементы.Добавить(Элемент);
				
			КонецЕсли; 
			
		Исключение
			
			Сообщение = новый СообщениеПользователю;
			Сообщение.Текст = ОписаниеОшибки();
			Сообщение.Сообщить();
			
		КонецПопытки; 
		
	КонецЦикла; 

КонецПроцедуры

#КонецОбласти
